{
  "articles": [
    {
      "title": "Emerging Trends and Future Directions in the Development of Anti-hepatitis B Therapies: A Horizon Scanning Review.",
      "abstract": "Chronic hepatitis B virus infection remains a Major global public health challenge, affecting over 254 million individuals and causing substantial mortality owing to the limited curative potential of current therapies. This horizon scanning review aims to comprehensively analyze emerging trends and future directions in novel anti-hepatitis B virus therapeutic development, evaluating their progress and potential to achieve functional or complete cures.",
      "authors": [
        "Yao K",
        "Feng H",
        "Chen Y",
        "Bao Y",
        "Yan M",
        "Li W",
        "Wu B"
      ],
      "journal": "Clin Drug Investig",
      "publishedDate": "2025 Oct",
      "keywords": [
        "hepatitis",
        "virus",
        "potential",
        "chronic",
        "infection",
        "remains",
        "major",
        "global"
      ],
      "researchField": "Computer Science",
      "subjects": [
        "hepatitis",
        "virus",
        "potential",
        "chronic",
        "infection",
        "remains",
        "major",
        "global"
      ],
      "externalId": "40960675",
      "source": "PubMed"
    },
    {
      "title": "Advancing nanotheranostics for neuro-immunological disorders: current status and future prospects.",
      "abstract": "Neuroimmunological disorders involve complex interactions between the nervous and immune systems, leading to various severe neurological conditions such as Alzheimer's disease, Parkinson's disease, and multiple sclerosis. These disorders are characterized by immune-mediated damage or inflammation within nervous tissue, resulting in cognitive deficits, movement issues, sensory impairments, and other neurological problems. They can affect people of all ages, but incidence increases significantly with advancing age, making them a growing public health concern. As the global population ages, the prevalence of neuroimmunological diseases is expected to rise sharply. Projections indicate that by 2050, approximately 150 million individuals worldwide may suffer from dementia-related disorders alone, with an economic burden reaching around $10 trillion. Current therapies mainly focus on symptom management, aiming to slow disease progression and improve quality of life. Emerging therapeutic strategies show promise, particularly nanomedicine, which employs nanoscale materials to deliver drugs precisely to affected tissues. This targeted approach reduces side effects and increases treatment effectiveness. Additionally, natural products and plant-based compounds are gaining attention for their neuroprotective effects, as they can modulate pathways involved in neuronal survival, repair, and immune regulation. Future research aims to deepen understanding of the molecular and genetic mechanisms underlying these disorders through advanced experimental models and technologies. These insights will facilitate the development of innovative therapies targeting neuroinflammation and immune dysregulation, with the goal of preventing disease progression or even achieving cures. Continued progress in neuroimmunology offers hope for improved treatment outcomes, reduced disease burden, and transformative advances in neurological healthcare worldwide.",
      "authors": [
        "Rai S",
        "Nair A",
        "Saleem Z",
        "Ray SK",
        "Kanwar JR",
        "Mukherjee S"
      ],
      "journal": "Neuroscience",
      "publishedDate": "2025 Oct 15",
      "keywords": [
        "disease",
        "disorders",
        "immune",
        "neurological",
        "these",
        "neuroimmunological",
        "nervous",
        "they"
      ],
      "researchField": "Medicine",
      "subjects": [
        "disease",
        "disorders",
        "immune",
        "neurological",
        "these",
        "neuroimmunological",
        "nervous",
        "they"
      ],
      "externalId": "40907816",
      "source": "PubMed"
    },
    {
      "title": "Chaplains' Charting in the USA in the Era of \"Open Notes:\" Recommendations from a Quality Improvement Project.",
      "abstract": "In the USA, the 21st Century CURES Act of 2016 requires healthcare providers to give patients online access to their electronic health records. This paper presents recommendations that arose from a three-stage quality improvement process concerning chaplains' note-writing in the era of \"open notes.\" Recommendations included utilizing strengths-based language, avoiding linguistic structures that express disbelief, making notes more concise, and using their notes to continue their care of patients. For chaplains in outpatient oncology clinical settings, additional recommendations take into account the use of phone outreach and the longer-term nature of spiritual care relationships.",
      "authors": [
        "Hirschmann J",
        "Terry K",
        "Van Thyn R",
        "Strano A"
      ],
      "journal": "J Relig Health",
      "publishedDate": "2025 Aug 23",
      "keywords": [
        "their",
        "recommendations",
        "notes",
        "patients",
        "chaplains",
        "care",
        "2016",
        "21st"
      ],
      "researchField": "Computer Science",
      "subjects": [
        "their",
        "recommendations",
        "notes",
        "patients",
        "chaplains",
        "care",
        "2016",
        "21st"
      ],
      "externalId": "40848096",
      "source": "PubMed"
    },
    {
      "title": "Lycium Barbarum Polysaccharides Protects Zebrafish Larvae From Nonylphenol-Induced Neurodevelopmental Disorders via the p38/5-HT1A/Wnt/β-Catenin Pathway.",
      "abstract": "Severe contamination with nonylphenol (NP) poses exposure risks and potential health problems for humans. However, direct evidence linking NP exposure to neurodevelopmental disorders in infants and young children remains limited, and the underlying mechanisms of such effects are unclear. Furthermore, neurodevelopmental disorders are characterized by their far-reaching impacts and lack of effective cures, emphasizing an urgent need to develop drugs targeting the treatment of these disorders. Therefore, in this study, we constructed a model of NP-induced neurodevelopmental disorders in zebrafish (7 days) to explore these mechanisms and examined the potential of lycium barbarum polysaccharide (LBP) as an intervention. We found that NP affected the neurobehavior of zebrafish and downregulated the expression of neurodevelopmental genes, resulting in neurodevelopmental disorders. Importantly, the 5-HT1A/Wnt/&#x3b2;-catenin signaling pathway was identified as closely related to neurodevelopmental disorders. Our study also found that NP activated the p38 pathway and inhibited the 5-HT1A/Wnt/&#x3b2;-catenin signaling pathway. In addition, we observed that LBP treatment significantly attenuated NP-induced neurodevelopmental disorders. In conclusion, the present study elucidated the mechanism by which NP may induce neurodevelopmental deficits through the p38/5-HT1A/Wnt/&#x3b2;-catenin signaling pathway and highlighted the protective potential of LBP against NP-induced developmental neurotoxicity.",
      "authors": [
        "Li K",
        "Li X",
        "Zhang Y",
        "Li X",
        "Chen Y",
        "Zhao Z",
        "Liu H",
        "Liu X",
        "Hou J",
        "Wu Q",
        "Li Y"
      ],
      "journal": "Chem Biodivers",
      "publishedDate": "2025 Aug 21",
      "keywords": [
        "neurodevelopmental",
        "disorders",
        "pathway",
        "potential",
        "induced",
        "ht1a",
        "x3b2",
        "catenin"
      ],
      "researchField": "General Science",
      "subjects": [
        "neurodevelopmental",
        "disorders",
        "pathway",
        "potential",
        "induced",
        "ht1a",
        "x3b2",
        "catenin"
      ],
      "externalId": "40839633",
      "source": "PubMed"
    },
    {
      "title": "Multi-laboratory comparisons of manual patch clamp hERG data generated using standardized protocols and following ICH S7B Q&A 2.1 best practices.",
      "abstract": "Acute block of hERG channels is the most common mechanism underlying drug-induced QTC prolongation and potentially fatal Torsade de Pointes arrhythmia. Updates to ICH E14 Q&amp;As now allow for using negative nonclinical data, including hERG, to support QTC risk assessment in late-stage clinical development. To interpret the hERG results, understanding hERG assay reproducibility or hERG data variability is pivotal. Protocol and best practice recommendations have been provided with the goal of minimizing lab-to-lab data differences, but the impact remains unclear. To fill this knowledge gap, hERG data from a HESI-coordinated multi-laboratory study were leveraged. Using standardized protocol and following best practices for patch clamp studies, five laboratories tested 28 drugs using the manual patch clamp technique. Systematic differences in block potencies were observed for data generated by one laboratory for the first 21 drugs, and these differences disappeared for the last seven drugs. Exposure, pharmacological sensitivity of the cell lines, and cell/data qualities were ruled out as the factors underlying systematic differences. All laboratories retested two drugs and obtained results within 1.6X of the initial testings, except for another laboratory that obtained data for one drug that differed from its initial testing by 7.6X. Descriptive statistics and meta-analysis were applied to the dataset to estimate what the distribution in hERG block potencies would be if a laboratory were to test the same drug repeatedly. This measure, or hERG data variability, was ~&#x2009;5X. Based on these results, hERG block potency values within 5X of each other should not be considered different, since these values are within the natural data distribution of the hERG assay; laboratory-specific safety margin threshold may be required to account for systematic data differences.",
      "authors": [
        "Alvarez Baron C",
        "Zhao J",
        "Yu H",
        "Ren M",
        "Thiebaud N",
        "Guo D",
        "Vegesna G",
        "Hsiao CH",
        "DePalma R",
        "Mistry S",
        "Tariq I",
        "Roni MSR",
        "Ismaiel OA",
        "Matta MK",
        "Patel V",
        "Mashaee M",
        "Vicente J",
        "Johannesen L",
        "Sheng J",
        "Hebeisen S",
        "Kramer J",
        "Bruening-Wright A",
        "Nakano K",
        "Matsukawa H",
        "Pierson JB",
        "Wu WW"
      ],
      "journal": "Sci Rep",
      "publishedDate": "2025 Aug 16",
      "keywords": [
        "herg",
        "data",
        "differences",
        "laboratory",
        "were",
        "block",
        "drugs",
        "drug"
      ],
      "researchField": "General Science",
      "subjects": [
        "herg",
        "data",
        "differences",
        "laboratory",
        "were",
        "block",
        "drugs",
        "drug"
      ],
      "externalId": "40819150",
      "source": "PubMed"
    },
    {
      "title": "Phytochemicals and brain health: The effects of curcumin, isoflavonoids, and ouabain.",
      "abstract": "Recent data underscores a critical public health issue: more than 40&#xa0;% of the global population suffers from neurological conditions, for which no cures currently exist. To combat this pressing challenge, researchers are turning to phytochemicals-bioactive compounds derived from plants that hold promising health benefits, particularly for cognitive function. This chapter intends to shed light on groundbreaking discoveries regarding curcumin, isoflavonoids, and cardiotonic steroids, natural compounds that act on the brain. These substances have shown significant potential for enhancing brain health as we age, especially in addressing neurodegenerative processes such as Alzheimer's and Parkinson's diseases. We will also examine the intricate molecular mechanisms these compounds activate to offer neuroprotection, supported by both in vitro and in vivo studies. Furthermore, we will analyze clinical trials that inspire optimism for the development of innovative therapeutic drugs in the near future. Supporting research in this area could be vital to transforming the landscape of neurological health.",
      "authors": [
        "Cantanzaro AB",
        "Orellana AM"
      ],
      "journal": "Prog Brain Res",
      "publishedDate": "2025",
      "keywords": [
        "health",
        "compounds",
        "from",
        "neurological",
        "brain",
        "these",
        "will",
        "recent"
      ],
      "researchField": "Computer Science",
      "subjects": [
        "health",
        "compounds",
        "from",
        "neurological",
        "brain",
        "these",
        "will",
        "recent"
      ],
      "externalId": "40769638",
      "source": "PubMed"
    },
    {
      "title": "Immunophenotyping of Patients With Rheumatoid Arthritis Reveals Difference in CD27(+)IgD(+) Unswitched Memory B Cell Profiles.",
      "abstract": "Objectives: Over the past decades, the prevalence of noncommunicable diseases has surged significantly, including the systemic autoimmune disorder rheumatoid arthritis (RA). Despite extensive research and advancement of RA therapy, effective prevention strategies or cures remain elusive, and the mechanisms underlying RA pathogenesis unclear. It is crucial to gain deeper insights into RA pathophysiology. The objective of this study is to provide a comprehensive immunophenotyping of patients with RA. Methods: We generated and analyzed deep immunophenotyping data from 52 patients with RA and 47 healthy controls (HCs). Whole blood samples were stained with extracellular markers, and intracellular antibodies and analyzed for 32 different cell markers using mass cytometry by time of flight. The acquired data was analyzed by both manual and automatic unsupervised tools and subsequently complemented with anthropometric data and clinical-laboratory parameters. Results: We observed a significant disparity in immune cell profiles between patients with RA and HC, notably a reduced frequency of CD27+IgD+ unswitched memory B (mB) cells in patients with RA (p-value&#x2009;&lt;&#x2009;0.01), with the disease RA being the primary and only significant factor explaining up to 17.9% of the variance of these cells. Conclusion: Our results reveal, for the first time, that a reduced frequency of unswitched mB cells in patients with RA is the only significant abnormality distinguishing patients with RA from HC in a complex immunophenotyping panel of 72 different cell populations. This provides important information to further individualize various interventions and possibly help to design novel therapeutic interventions.",
      "authors": [
        "Hansen B",
        "Da Costa R",
        "Revets D",
        "Hedin F",
        "Konstantinou M",
        "Jubal ER",
        "Ngangom F",
        "Laczny CC",
        "Roomp K",
        "Petrov V",
        "Michalsen A",
        "Hanslian E",
        "Koppold DA",
        "Khokhar AR",
        "Steckhan N",
        "Jeitler M",
        "Mollenhauer B",
        "Schade S",
        "Vaillant M",
        "Cosma A",
        "Wilmes P",
        "Schneider JG"
      ],
      "journal": "Mediators Inflamm",
      "publishedDate": "2025",
      "keywords": [
        "patients",
        "immunophenotyping",
        "analyzed",
        "data",
        "cell",
        "significant",
        "cells",
        "from"
      ],
      "researchField": "General Science",
      "subjects": [
        "patients",
        "immunophenotyping",
        "analyzed",
        "data",
        "cell",
        "significant",
        "cells",
        "from"
      ],
      "externalId": "40766288",
      "source": "PubMed"
    },
    {
      "title": "A practical and safer model of nitrogen mustard injury in cornea.",
      "abstract": "Sulfur mustard (SM) is an alkylating agent used in warfare and terrorism that inflicts devastating ocular injuries. Although the clinical symptoms are well described, the underlying mechanisms are not fully understood, hindering the development of effective treatments. One major roadblock is the lack of a suitable model due to the extremely hazardous nature of SM, which requires strict safety measures. As a safer and practical alternative, we report a novel model that uses mechlorethamine (nitrogen mustard) gel, an FDA-approved topical chemotherapeutic administered by patients at home. Here we demonstrate its suitability to induce mustard corneal injury in any laboratory.",
      "authors": [
        "Sandoval-Castellanos AM",
        "Ke Y",
        "Dam TM",
        "Maverakis EM",
        "Mannis MJ",
        "Wang XJ",
        "Zhao M"
      ],
      "journal": "PLoS One",
      "publishedDate": "2025",
      "keywords": [
        "mustard",
        "model",
        "sulfur",
        "alkylating",
        "agent",
        "used",
        "warfare",
        "terrorism"
      ],
      "researchField": "General Science",
      "subjects": [
        "mustard",
        "model",
        "sulfur",
        "alkylating",
        "agent",
        "used",
        "warfare",
        "terrorism"
      ],
      "externalId": "40608742",
      "source": "PubMed"
    },
    {
      "title": "Performance of Bleeding Risk Scores for Major Bleeding in Anticoagulated Patients with Pulmonary Embolism: Insights from the CURES Registry-2.",
      "abstract": "Most bleeding risk scores for pulmonary embolism (PE) were developed in patients receiving traditional anticoagulants. Evidence in East Asian populations and its applicability to direct oral anticoagulants (DOACs) remain limited.This post-hoc analysis was based on a multicentre, prospective study (NCT02943343) conducted from 2016 to 2021. The predictive performance of bleeding risk scores was assessed using a time-dependent area under the receiver operating characteristic curve (AUC), net reclassification improvement (NRI), and decision curve analysis (DCA). Propensity score matching (PSM) was adjusted for baseline characteristics. We analyzed the impact of initial DOAC versus low-molecular-weight heparin (LMWH) on outcomes. The endpoint was major bleeding (MB) within 90 days and composite outcomes (all-cause mortality, recurrent VTE, and MB).Of 7,619 patients with PE, 1.4% (107 patients) experienced MB within 90 days. The RIETE score showed a modest predictive ability (AUC: 0.70; 95% CI, 0.65-0.75) for predicting 90-day MB and demonstrated a predictive advantage in the DCA results. NRI also revealed significantly better reclassification capability than the other scores, except for HAS-BLED. Among low-risk patients classified by the RIETE score, initial DOAC treatment significantly reduced 14-day composite outcomes compared with LMWH (HR&#x2009;=&#x2009;0.13; 95% CI, 0.02-0.93). Furthermore, DOACs at discharge did not increase the risk of MB or composite outcomes.RIETE score shows modest performance in predicting MB and identifying low bleeding risk in PE patients, which could potentially guide early DOAC use. Further studies are needed to test its clinical utility, especially in East Asian populations.",
      "authors": [
        "Tao Y",
        "Chen H",
        "Dong C",
        "Zhang J",
        "Shi Y",
        "Xu X",
        "Wang M",
        "Zhu L",
        "Shi J",
        "Ji Y",
        "Chen H",
        "Cheng Z",
        "Tang Y",
        "Li Y",
        "Deng C",
        "Luo Q",
        "Lu P",
        "Yang Y",
        "Xi L",
        "Zhang Y",
        "Liang R",
        "Wang D",
        "Fan G",
        "Xie W",
        "Wan J",
        "Zhang Z",
        "Zhang S",
        "Zhang Y",
        "Huang Q",
        "Gao Q",
        "Liu M",
        "Yang P",
        "Wang S",
        "Wang C",
        "Zhai Z",
        "CURES investigators"
      ],
      "journal": "Thromb Haemost",
      "publishedDate": "2025 Jul 17",
      "keywords": [
        "risk",
        "patients",
        "bleeding",
        "score",
        "outcomes",
        "scores",
        "predictive",
        "doac"
      ],
      "researchField": "General Science",
      "subjects": [
        "risk",
        "patients",
        "bleeding",
        "score",
        "outcomes",
        "scores",
        "predictive",
        "doac"
      ],
      "externalId": "40555360",
      "source": "PubMed"
    },
    {
      "title": "Harvard Electroencephalography Database: A comprehensive clinical electroencephalographic resource from four Boston hospitals.",
      "abstract": "This article presents the Harvard Electroencephalography Database (HEEDB), a large-scale, deidentified, and standardized electroencephalographic (EEG) resource supporting artificial intelligence-driven and reproducible research in epilepsy and broader clinical neuroscience.",
      "authors": [
        "Sun C",
        "Jing J",
        "Turley N",
        "Alcott C",
        "Kang WY",
        "Cole AJ",
        "Goldenholz DM",
        "Lam A",
        "Amorim E",
        "Chu C",
        "Cash S",
        "Junior VM",
        "Gupta A",
        "Ghanta M",
        "Nearing B",
        "Nascimento FA",
        "Struck A",
        "Kim J",
        "Sartipi S",
        "Tauton AM",
        "Fernandes M",
        "Sun H",
        "Bayas G",
        "Gallagher K",
        "Wagenaar JB",
        "Sinha N",
        "Lee-Messer C",
        "Silvers CT",
        "Gunapati B",
        "Rosand J",
        "Peters J",
        "Loddenkemper T",
        "Lee JW",
        "Zafar S",
        "Westover MB"
      ],
      "journal": "Epilepsia",
      "publishedDate": "2025 Sep",
      "keywords": [
        "article",
        "presents",
        "harvard",
        "electroencephalography",
        "database",
        "heedb",
        "large",
        "scale"
      ],
      "researchField": "General Science",
      "subjects": [
        "article",
        "presents",
        "harvard",
        "electroencephalography",
        "database",
        "heedb",
        "large",
        "scale"
      ],
      "externalId": "40464151",
      "source": "PubMed"
    },
    {
      "title": "Immunoinformatic-driven design and evaluation of multi-epitope mRNA vaccine targeting HIV-1 gp120.",
      "abstract": "HIV (human immunodeficiency virus) presents a global health crisis, causing significant AIDS-related deaths and over one million new infections annually. The curbing of HIV is an intricate and continuously evolving domain, marked by numerous challenges, including drug resistance and the absence of a significant cure or vaccine because of its mutating ability and diverse antigens in its envelope, prompting research for functional cures and long-term remission strategies. The endeavor to devise an HIV vaccine capable of eliciting robust and broadly cross-reactive humoral and cellular immune responses is a formidable undertaking, primarily due to the pronounced genetic heterogeneity of HIV-1, the variances observed in virus subtypes (clades) across distinct geographic regions, and the polymorphic nature of human leukocyte antigens (HLA). The viral envelope protein (gp120) selectively interacts with CD4 and chemokine receptors on the surface of target cells. It serves as the key initiator in the intricate viral entry into host cells, rendering it a compelling candidate for vaccine development. This study used bioinformatic tools to design a safe, hypoallergenic, and non-toxic mRNA HIV-1 vaccine by assembling immunogenic B- and T-cell epitopes from the gp120 protein. We identified antigenic, non-toxic, and non-allergic B-cell epitopes (IEPLGIAPTRAKRRVVER) and T-cell epitopes (QQKVHALFY, ITIGPGQVF, WQGVGQAMY, APTRAKRRV, KQQKVHALFYRLDIV, QQKVHALFYRLDIVQ, QKVHALFYRLDIVQI, SLAEEEIIIRSENLT, and IRSENLTNNVKTIIV). For designing the mRNA vaccine against HIV-1 gp120, we assembled the epitopes with 5' m7G cap, 5' UTR (untranslated region), Kozak sequence, signal peptide (tPA), RpfE (resuscitation-promoting factor E) adjuvant at N-terminal and MITD (MHC class I trafficking domain) adjuvant, stop codon, 3' UTR, and 120-nucleotide long poly(A) tail at the C-terminal with immunogenic robustness linkers. The mRNA vaccine is translated into a protein-based vaccine by the host body's ribosomes. Their comprehensive computational findings, including physicochemical, structural, and 3D refinement analyses, substantiated the stability and quality of the translated vaccine. Molecular docking and simulation revealed a strong and stable binding affinity of vaccine immunization with immune cells' pattern recognition receptors (TLR4). Immune simulations demonstrated a potent primary immune response characterized by a gradual increase in immunoglobulins and a corresponding decline in antigen concentration. This bioinformatics-driven study presents a promising HIV-1 mRNA vaccine candidate, underscoring the need for further experimental validation through preclinical and clinical trials. At the same time, its methodologies hold the potential for addressing other challenging infectious diseases, thereby impacting vaccinology broadly.",
      "authors": [
        "Ahmed MZ",
        "Rao T",
        "Mutahir Z",
        "Ahmed S",
        "Ullah N",
        "Ojha SC"
      ],
      "journal": "Front Immunol",
      "publishedDate": "2025",
      "keywords": [
        "vaccine",
        "immune",
        "mrna",
        "epitopes",
        "protein",
        "gp120",
        "cells",
        "cell"
      ],
      "researchField": "Biotechnology",
      "subjects": [
        "vaccine",
        "immune",
        "mrna",
        "epitopes",
        "protein",
        "gp120",
        "cells",
        "cell"
      ],
      "externalId": "40433366",
      "source": "PubMed"
    },
    {
      "title": "Stem cell therapy as treatment for Stargardt disease.",
      "abstract": "Stargardt disease or Juvenile Macular Degeneration is a rare genetic disorder caused by a mutation in the ABCA4 gene that results in degeneration of the macula and loss of central vision. The mutation in the ABCA4 gene causes a build-up of lipofuscin, which is a substance that is left over from the breakdown and absorption of damaged blood cells. This build-up of lipofuscin causes the death of photoreceptor cells and the subsequent degeneration of the macula. Due to the nature of Stargardt's disease, there are currently no cures or treatment options. However, in recent years, there has been an increase in research and exploration of utilizing stem cell therapy as a potential cure and treatment for Stargardt disease. Growing research in the field of ophthalmology has found that the use of stem cells can potentially replace the loss of photoreceptor cells, slow the progression of the degeneration of vision, and be a potential new treatment option for Stargardt disease.",
      "authors": [
        "Marks E",
        "Anugu A",
        "Bisiani J",
        "Pentyala S"
      ],
      "journal": "Ther Adv Ophthalmol",
      "publishedDate": "2025 Jan-Dec",
      "keywords": [
        "stargardt",
        "disease",
        "degeneration",
        "cells",
        "treatment",
        "mutation",
        "abca4",
        "gene"
      ],
      "researchField": "Biotechnology",
      "subjects": [
        "stargardt",
        "disease",
        "degeneration",
        "cells",
        "treatment",
        "mutation",
        "abca4",
        "gene"
      ],
      "externalId": "40417263",
      "source": "PubMed"
    },
    {
      "title": "Protein kinases in neurodegenerative diseases: current understandings and implications for drug discovery.",
      "abstract": "Neurodegenerative diseases (e.g., Alzheimer's, Parkinson's, Huntington's disease, and Amyotrophic Lateral Sclerosis) are major health threats for the aging population and their prevalences continue to rise with the increasing of life expectancy. Although progress has been made, there is still a lack of effective cures to date, and an in-depth understanding of the molecular and cellular mechanisms of these neurodegenerative diseases is imperative for drug development. Protein phosphorylation, regulated by protein kinases and protein phosphatases, participates in most cellular events, whereas aberrant phosphorylation manifests as a main cause of diseases. As evidenced by pharmacological and pathological studies, protein kinases are proven to be promising therapeutic targets for various diseases, such as cancers, central nervous system disorders, and cardiovascular diseases. The mechanisms of protein phosphatases in pathophysiology have been extensively reviewed, but a systematic summary of the role of protein kinases in the nervous system is lacking. Here, we focus on the involvement of protein kinases in neurodegenerative diseases, by summarizing the current knowledge on the major kinases and related regulatory signal transduction pathways implicated in diseases. We further discuss the role and complexity of kinase-kinase networks in the pathogenesis of neurodegenerative diseases, illustrate the advances of clinical applications of protein kinase inhibitors or novel kinase-targeted therapeutic strategies (such as antisense oligonucleotides and gene therapy) for effective prevention and early intervention.",
      "authors": [
        "Wu X",
        "Yang Z",
        "Zou J",
        "Gao H",
        "Shao Z",
        "Li C",
        "Lei P"
      ],
      "journal": "Signal Transduct Target Ther",
      "publishedDate": "2025 May 7",
      "keywords": [
        "diseases",
        "protein",
        "kinases",
        "neurodegenerative",
        "kinase",
        "major",
        "been",
        "effective"
      ],
      "researchField": "Biotechnology",
      "subjects": [
        "diseases",
        "protein",
        "kinases",
        "neurodegenerative",
        "kinase",
        "major",
        "been",
        "effective"
      ],
      "externalId": "40328798",
      "source": "PubMed"
    },
    {
      "title": "The Natural History of Acanthamoeba Keratitis: A Systematic Literature Review.",
      "abstract": "Acanthamoeba keratitis (AK) was first identified in 1972 and the first patient cured with propamidine was reported in 1985. Treatment outcomes, before the advent of the first effective anti-amoebic treatment, were known to be poor and often required therapeutic keratoplasty (TK) but have not been evaluated in detail. Analysis of these outcomes has value for several reasons: it gives an historical perspective, describes the natural history of AK when the disease was minimally modified by the early treatments and provides a benchmark against which current treatments can be compared and how these have changed the therapeutic results.",
      "authors": [
        "Papa V",
        "Bodicoat DH",
        "Duarte AA",
        "Dart JKG",
        "De Francesco M"
      ],
      "journal": "Ophthalmol Ther",
      "publishedDate": "2025 Jul",
      "keywords": [
        "first",
        "treatment",
        "outcomes",
        "therapeutic",
        "have",
        "these",
        "treatments",
        "1972"
      ],
      "researchField": "General Science",
      "subjects": [
        "first",
        "treatment",
        "outcomes",
        "therapeutic",
        "have",
        "these",
        "treatments",
        "1972"
      ],
      "externalId": "40323557",
      "source": "PubMed"
    },
    {
      "title": "A Content Analysis of YouTube Videos on Allergic Rhinitis Management.",
      "abstract": "This study evaluates the quality, reliability, and usability of YouTube videos on allergic rhinitis (AR) management using validated assessment tools to determine their alignment with evidence-based practices and their potential impact on patient understanding.",
      "authors": [
        "Kumar S",
        "Dutta A",
        "Vallur S",
        "Singh R"
      ],
      "journal": "Indian J Otolaryngol Head Neck Surg",
      "publishedDate": "2025 Apr",
      "keywords": [
        "their",
        "evaluates",
        "quality",
        "reliability",
        "usability",
        "youtube",
        "videos",
        "allergic"
      ],
      "researchField": "General Science",
      "subjects": [
        "their",
        "evaluates",
        "quality",
        "reliability",
        "usability",
        "youtube",
        "videos",
        "allergic"
      ],
      "externalId": "40226266",
      "source": "PubMed"
    },
    {
      "title": "Maternal health outcomes in ornithine transcarbamylase deficiency: A comparative analysis of pregnancies in symptomatic and asymptomatic heterozygotes.",
      "abstract": "Ornithine transcarbamylase deficiency (OTCD, MIM: 311250) is an X-linked disorder of ureagenesis caused by pathogenic variants in OTC (MIM: 300461). Due to varying X-inactivation patterns, female heterozygotes can range from asymptomatic to severe disease with recurrent hyperammonemia. There is a paucity of data regarding the safety of pregnancy in symptomatic versus asymptomatic OTC heterozygotes. Existing case reports suggest a high risk of morbidity and mortality associated with pregnancy.",
      "authors": [
        "Breilyn MS",
        "Simpson K",
        "Elsbecker SA",
        "Barber JR",
        "Members of the Urea Cycle Disorders Consortium (UCDC)",
        "Bryan K",
        "Berry SA"
      ],
      "journal": "Mol Genet Metab",
      "publishedDate": "2025 Apr",
      "keywords": [
        "heterozygotes",
        "asymptomatic",
        "pregnancy",
        "300461",
        "311250",
        "ornithine",
        "transcarbamylase",
        "deficiency"
      ],
      "researchField": "General Science",
      "subjects": [
        "heterozygotes",
        "asymptomatic",
        "pregnancy",
        "300461",
        "311250",
        "ornithine",
        "transcarbamylase",
        "deficiency"
      ],
      "externalId": "40081191",
      "source": "PubMed"
    },
    {
      "title": "Paving the way toward treatment solutions for CTNNB1 syndrome: a patient organization perspective.",
      "abstract": "The CTNNB1 Connect &amp; Cure and CTNNB1 Foundation, alongside Asociaci&#xf3;n CTNNB1, CTNNB1 Italia, Association CTNNB1 France, and researchers and clinicians globally are dedicated to finding effective treatments and cures for CTNNB1 syndrome. The syndrome is also characterized by progressive spasticity, which can in some cases cause loss of already achieved motor milestones. Since 2019, they have brought together researchers from different fields and invested in various research efforts to advance the search for treatment solutions for patients with CTNNB1 syndrome. Simons Searchlight serves as an important platform by remotely collecting high-quality, standardized data on the natural history of the disease and making it available to researchers around the world. Conducting genotype-phenotype correlation study and biochemically characterizing the mutations were critical to understand the effects of the patients' mutations and related molecular function to symptoms. Several induced pluripotent stem cells were generated from patient cells, and preclinical mouse models have provided new insights into the molecular downstream effects of CTNNB1 haploinsufficiency. Multiple therapeutic approaches are in the developing, including small molecule treatments, RNA- and DNA-based therapies, AAV9 gene replacement therapy, which entered the manufacturing phase in November 2023. In this article, we summarize the journey of the CTNNB1 community and its organizations, highlight ongoing and future research projects, and outline the available research resources. The vision for the CTNNB1 community is that in the future several therapeutic options will be available that can be customized to every CTNNB1 patient's needs.",
      "authors": [
        "Miroševič Š",
        "Khandelwal S",
        "Amerson E",
        "Parks E",
        "Parks M",
        "Cochran L",
        "González Hernández A",
        "Ferraro M",
        "Lisowski L",
        "Perez-Iturralde A",
        "Chung W",
        "Jacob MH",
        "Žakelj N",
        "Lainšček D",
        "Forstnerič V",
        "Sušjan P",
        "Maruna M",
        "Jerala R",
        "Osredkar D"
      ],
      "journal": "Ther Adv Rare Dis",
      "publishedDate": "2025 Jan-Dec",
      "keywords": [
        "ctnnb1",
        "researchers",
        "syndrome",
        "available",
        "treatments",
        "which",
        "have",
        "from"
      ],
      "researchField": "Computer Science",
      "subjects": [
        "ctnnb1",
        "researchers",
        "syndrome",
        "available",
        "treatments",
        "which",
        "have",
        "from"
      ],
      "externalId": "39949392",
      "source": "PubMed"
    },
    {
      "title": "β-Cyclodextrin nanosponges for the ocular delivery of therapeutic Micro-RNA in a Mouse model of retinitis Pigmentosa: A proof of concept study.",
      "abstract": "The exploitation of micro-RNA (miR) sequences as therapeutics has become highly attractive for the treatment of several diseases, including those still lacking effective cures such as retinitis pigmentosa (RP). Interestingly, miR-155-5p plays a role in photo-oxidative inflammation in wild-type mice and is up-regulated in rd10 mice showing peak rod degeneration, suggesting its inhibition by the corresponding anti-miR as a viable therapeutic strategy for RP. However, biomedical application of (anti-)miRs is limited by their oligonucleotide nature, suffering from low solubility and bioavailability along with a very low half-life in vivo due to enzymatic degradation. Thereby, the need for suitable delivery systems led to the development of various nanocarriers, including oligosaccharide-based polymers. In this context, we designed and prepared an innovative nanosponge (NS) with a &#x3b2;-cyclodextrin (&#x3b2;-CD) motif payload with a bridge-like molecule, the amphipathic adamantane derivative (ADM), able to establish strong interactions with both NS and the therapeutic miR, thereby delivering and eventually releasing it close to the active site. Through an in vivo study, we both validated the NS system as a useful tool for miR topical administration by eye drop formulation and the functional activity of anti-miR-155-5p in RP.",
      "authors": [
        "Piano I",
        "Polini B",
        "Corsi F",
        "Carpi S",
        "Petrarolo G",
        "Quattrini L",
        "D'Agostino I",
        "Gamberini MC",
        "Baraldi C",
        "Chiellini G",
        "Nieri P",
        "Motta C",
        "Gargini C"
      ],
      "journal": "Eur J Pharm Biopharm",
      "publishedDate": "2025 Mar",
      "keywords": [
        "anti",
        "including",
        "mice",
        "therapeutic",
        "vivo",
        "thereby",
        "x3b2",
        "both"
      ],
      "researchField": "General Science",
      "subjects": [
        "anti",
        "including",
        "mice",
        "therapeutic",
        "vivo",
        "thereby",
        "x3b2",
        "both"
      ],
      "externalId": "39914571",
      "source": "PubMed"
    },
    {
      "title": "Melatonin Overexpression in the Management of Alzheimer's Disease: Therapeutic Exploration.",
      "abstract": "Alzheimer's Disease (AD), a progressive neurodegenerative disorder, is characterized by the accumulation of neurofibrillary tangles and &#x3b2;-amyloid plaques, leading to a decline in cognitive function. AD is characterized by tau protein hyperphosphorylation and extracellular &#x3b2;-amyloid accumulation. Even after much research, there are still no proven cures for AD. The neuroprotective, anti-inflammatory, and antioxidant qualities of melatonin, a hormone mostly produced by the pineal gland, have drawn interest as a possible treatment option for AD. This study looks at new evidence that suggests melatonin overexpression to be a promising therapy option for AD. Melatonin levels naturally decline with age and decrease more significantly in individuals with AD, worsening neurodegenerative processes. Melatonin has therapeutic potential as it inhibits A&#x3b2; formation, prevents amyloid fibril extension through structure-dependent interactions, and protects neurons from A&#x3b2;-induced toxicity. Melatonin promotes neurogenesis, which is decreased in AD, suggesting it may treat the disease's many pathologies. The review emphasizes the importance of melatonin's mechanisms of action, including its capacity to reduce neuroinflammation, regulate mitochondrial function, scavenge free radicals, and influence apoptotic pathways. As research into AD continues, this article provides a forward-looking perspective on how future studies could leverage melatonin's multifaceted neuroprotective properties to develop more effective treatments for AD.",
      "authors": [
        "Gupta B",
        "Malviya R",
        "Sundram S",
        "Sridhar SB",
        "Singh DP"
      ],
      "journal": "Curr Top Med Chem",
      "publishedDate": "2025 Jan 29",
      "keywords": [
        "melatonin",
        "x3b2",
        "amyloid",
        "disease",
        "neurodegenerative",
        "characterized",
        "accumulation",
        "decline"
      ],
      "researchField": "Biotechnology",
      "subjects": [
        "melatonin",
        "x3b2",
        "amyloid",
        "disease",
        "neurodegenerative",
        "characterized",
        "accumulation",
        "decline"
      ],
      "externalId": "39886794",
      "source": "PubMed"
    },
    {
      "title": "The relevance of the evolutionary approach for understanding health and disease of the human body and mind.",
      "abstract": "Ultimate and proximate levels of analysis offer synergistic explanations can improve the search for causes of disease and their cures. Here we review how several principles of evolutionary biology such as historical contingencies, mismatches, trade-offs, sexual selection and genomic conflict are applied to problems in medicine and psychiatry. The application of evolutionary principles to many other domains of medicine, among them mental disorders, have not received the same reception from preclinical and clinical researchers. The lack of a well-coordinated interdisciplinarity may be one reason for the slow application of evolutionary principles to biomedicine and psychiatry. This is exemplified by the case of ethopharmacology, an evolutionary approach to psychopharmacology strongly proposed and applied by ethologists but apparently unknown to many evolutionary minded scholars. Another reason has to do with the lack of efforts from many medical schools to integrate evolution and its principles in their curriculum studiorum. Interestingly, this Darwinian approach is generating an important evolutionary epistemology for the study of body and human mind health and diseases.",
      "authors": [
        "Ponzi D",
        "Parmigiani S",
        "Paterlini S",
        "Bellantoni M",
        "Palanza P"
      ],
      "journal": "Neurosci Biobehav Rev",
      "publishedDate": "2025 Feb",
      "keywords": [
        "evolutionary",
        "principles",
        "many",
        "their",
        "applied",
        "medicine",
        "psychiatry",
        "application"
      ],
      "researchField": "General Science",
      "subjects": [
        "evolutionary",
        "principles",
        "many",
        "their",
        "applied",
        "medicine",
        "psychiatry",
        "application"
      ],
      "externalId": "39805328",
      "source": "PubMed"
    },
    {
      "title": "Fractionated low-dose radiotherapy primes the tumor microenvironment for immunotherapy in a murine mesothelioma model.",
      "abstract": "Combination immune checkpoint inhibitors (nivolumab and ipilimumab) are currently a first-line treatment for mesothelioma; however, not all patients respond. The efficacy of treatment is influenced by the tumor microenvironment. Murine mesothelioma tumors were irritated with various radiotherapy doses. Radiotherapy induced vasculature changes were monitored by power Doppler and photoacoustic ultrasound and analyzed via mixed-effects models. Tissue staining was used to investigate the immune cell infiltrate of tumors. The optimal radiotherapy schedule was combined with immune checkpoint inhibitors, and the survival of mice was analyzed. Using low-dose, low-fraction radiotherapy allowed favorable modification of the murine mesothelioma tumor microenvironment. Irradiating tumors with 2&#xa0;Gy&#x2009;&#xd7;&#x2009;5 fractions significantly improved blood flow and reduced hypoxia, consequently increasing the presence of CD8+ and regulatory T cells in the tumor. Understanding the transient nature of these changes is crucial for optimizing the timing of therapeutic delivery. The combination of radiotherapy with dual immunotherapy (anti-PD-1 plus anti-CTLA-4) proved highly curative when administered concurrently. A diminishing rate of cures was noted with an increasing delay between radiotherapy and subsequent immunotherapy. Concurrent low-dose, low-fraction radiotherapy emerges as a translatable approach for improving the efficacy of immune checkpoint inhibitors in patients.",
      "authors": [
        "D'Alonzo RA",
        "Keam S",
        "Gill S",
        "Rowshanfarzad P",
        "Nowak AK",
        "Ebert MA",
        "Cook AM"
      ],
      "journal": "Cancer Immunol Immunother",
      "publishedDate": "2025 Jan 3",
      "keywords": [
        "radiotherapy",
        "immune",
        "checkpoint",
        "inhibitors",
        "mesothelioma",
        "tumor",
        "tumors",
        "combination"
      ],
      "researchField": "Medicine",
      "subjects": [
        "radiotherapy",
        "immune",
        "checkpoint",
        "inhibitors",
        "mesothelioma",
        "tumor",
        "tumors",
        "combination"
      ],
      "externalId": "39751851",
      "source": "PubMed"
    },
    {
      "title": "Metallodrugs: Synthesis, mechanism of action and nanoencapsulation for targeted chemotherapy.",
      "abstract": "As a multifactorial and heterogeneous disease, cancer has a high mortality rate, and the search for more effective treatments is an enormous challenge. Metal coordination compounds open a range of possibilities that conventional organic and biological molecules can no longer fulfil due to increasing drug resistance. Metallodrugs still have tremendous potential to help overcome drug resistance and find new cures in medicine, considering that at least 25 metallic elements participate in healthy functioning of the human body. Transition metal ions, such as copper, zinc and iron, are incorporated into catalytic proteins, the so-called metalloenzymes, which participate in various chemical reactions necessary for life. The interaction of metal complexes in different pathways with the structural richness of deoxyribonucleic acid encouraged to seek to understand the mechanisms of action and overcome the obstacles encountered for a promising future of these drugs. The success of platinum-based metallodrugs is one of the great inspirations for the search of new metallodrugs, although the approval of these molecules has been slow in recent years due to the risk of systemic toxicity and insufficient understanding of their mechanisms. To overcome the clinical limitations encountered in some metallodrugs, nanoencapsulation has been proposed as a new approach to improve therapeutic index in chemotherapy. The remarkable selectivity of nanoencapsulated metallodrugs and their enhanced capacity to bypass various biological barriers allow site-specific targeting. In this review, we present the advances in the development and use of the most relevant metallodrugs, and new delivery approaches, in the fight against cancer.",
      "authors": [
        "Rodrigues JAO",
        "Kiran NS",
        "Chatterjee A",
        "Prajapati BG",
        "Dhas N",
        "Dos Santos AO",
        "de Sousa FF",
        "Souto EB"
      ],
      "journal": "Biochem Pharmacol",
      "publishedDate": "2025 Jan",
      "keywords": [
        "metallodrugs",
        "metal",
        "overcome",
        "cancer",
        "search",
        "biological",
        "molecules",
        "drug"
      ],
      "researchField": "Medicine",
      "subjects": [
        "metallodrugs",
        "metal",
        "overcome",
        "cancer",
        "search",
        "biological",
        "molecules",
        "drug"
      ],
      "externalId": "39577705",
      "source": "PubMed"
    },
    {
      "title": "The effect of long term astaxanthin supplementation on the antioxidant status of racing Arabian horses - preliminary study.",
      "abstract": "Astaxanthin due to its strong antioxidant activity is believed to reduce oxidative stress and therefore is considered as feed additive in pathological conditions and also for the athletes. It is promoted by several equine web portals, however, data supporting that concept in horses is limited. Thus, the aim of this study was to evaluate the effect of astaxanthin supplementation on the parameters of oxidative status in 3 years old, racing Arabian horses during long term observation and the changes related to a single training session of high intensity. Six horses were supplemented with astaxanthin at a dose of 0.52-0.58&#xa0;mg/kg BW and 7 received no supplementation. Astaxanthin supplementation resulted in the increase in total antioxidant status by 31.5%, accompanied by decreases in the amount of total thiobarbituric acid-reactive substances -TBARS and glutathione reductases - GR values by 34.5% and 45.4%, respectively, after 1 month and this effect persisted until the end of the observation. After individual training session the activities of glutathione peroxidases and GR were lower by 69% and 46%, respectively, and TBARS lower by 38% in supplemented horses. These results directly confirmed the beneficial effects of astaxanthin supplementation on the antioxidant status of race horses. Astaxanthin partially counterbalance the training-related oxidative stress, save the horse natural antioxidant defense, and shift the redox status towards a more reducing environment. At the same time, exercise-induced reactive oxygen species production at certain level was maintained and so that contributed to training progress.",
      "authors": [
        "Giercuszkiewicz-Hecold B",
        "Kulka M",
        "Czopowicz M",
        "Wilczak J",
        "Szarska E",
        "Strzelec K",
        "Grzeczka A",
        "Graczyk S",
        "Hryniszyn A",
        "Mularczyk M",
        "Marycz K",
        "Cywińska A"
      ],
      "journal": "Sci Rep",
      "publishedDate": "2024 Nov 14",
      "keywords": [
        "astaxanthin",
        "horses",
        "antioxidant",
        "supplementation",
        "status",
        "training",
        "oxidative",
        "stress"
      ],
      "researchField": "Computer Science",
      "subjects": [
        "astaxanthin",
        "horses",
        "antioxidant",
        "supplementation",
        "status",
        "training",
        "oxidative",
        "stress"
      ],
      "externalId": "39543175",
      "source": "PubMed"
    },
    {
      "title": "In utero human cytomegalovirus infection expands NK-like FcγRIII+CD8+ T cells that mediate Fc antibody functions.",
      "abstract": "Human cytomegalovirus (HCMV) profoundly impacts host T and NK cells across the lifespan, yet how this common congenital infection modulates developing fetal immune cell compartments remains underexplored. Using cord blood from neonates with and without congenital HCMV (cCMV) infection, we identify an expansion of Fc&#x3b3; receptor III-expressing (Fc&#x3b3;RIII-expressing) CD8+ T cells following HCMV exposure in utero. Most Fc&#x3b3;RIII+CD8+ T cells express the canonical &#x3b1;&#x3b2; T cell receptor (TCR), but a proportion express noncanonical &#x3b3;&#x3b4; TCR. Fc&#x3b3;RIII+CD8+ T cells are highly differentiated and have increased expression of NK cell markers and cytolytic molecules. Transcriptional analysis reveals Fc&#x3b3;RIII+CD8+ T cells upregulate T-bet and downregulate BCL11B, known transcription factors that govern T/NK cell fate. We show that Fc&#x3b3;RIII+CD8+ T cells mediate antibody-dependent IFN-&#x3b3; production and degranulation against IgG-opsonized target cells, similar to NK cell antibody-dependent cellular cytotoxicity (ADCC). Fc&#x3b3;RIII+CD8+ T cell Fc effector functions were further enhanced by IL-15, as has been observed in neonatal NK cells. Our study reveals that Fc&#x3b3;RIII+CD8+ T cells elicited in utero by HCMV infection can execute Fc-mediated effector functions bridging cellular and humoral immunity and may be a promising target for antibody-based therapeutics and vaccination in early life.",
      "authors": [
        "Semmes EC",
        "Nettere DR",
        "Nelson AN",
        "Hurst JH",
        "Cain DW",
        "Burt TD",
        "Kurtzberg J",
        "Reeves RK",
        "Coyne CB",
        "Fouda GG",
        "Pollara J",
        "Permar SR",
        "Walsh KM"
      ],
      "journal": "J Clin Invest",
      "publishedDate": "2024 Nov 12",
      "keywords": [
        "x3b3",
        "cells",
        "riii",
        "cell",
        "hcmv",
        "infection",
        "antibody",
        "congenital"
      ],
      "researchField": "General Science",
      "subjects": [
        "x3b3",
        "cells",
        "riii",
        "cell",
        "hcmv",
        "infection",
        "antibody",
        "congenital"
      ],
      "externalId": "39531313",
      "source": "PubMed"
    },
    {
      "title": "Estimated Glomerular Filtration Rate Decline is Causally Associated with Acute Pulmonary Embolism: A Nested Case-Control and Mendelian Randomization Study.",
      "abstract": "Renal dysfunction is highly prevalent among patients with pulmonary embolism (PE). This study combined population-based study and Mendelian randomization (MR) to observe the relationship between renal function and PE.A nested case-control study were performed using data of PE patients and controls were from two nationwide cohorts, the China pUlmonary thromboembolism REgistry Study (CURES) and China Health and Retirement Longitudinal Survey (CHARLS). Baseline characteristics were balanced using propensity score matching and inverse probability of treatment weighting. Restricted cubic spline models were applied for the relationship between estimated glomerular filtration rate (eGFR) decline and the risk of PE. Bidirectional two-sample MR analyses were performed using genome-wide association study summary statistics for eGFR involving 1,201,909 individuals and for PE from the FinnGen consortium.The nested case-control study including 17,547 participants (6,322 PE patients) found that eGFR distribution was significantly different between PE patients and controls (p&#x2009;&lt;&#x2009;0.001), PE patients had a higher proportion of eGFR&#x2009;&lt;&#x2009;60&#x2009;mL/min/1.73&#x2009;m2. eGFR below 88&#x2009;mL/min/1.73&#x2009;m2 was associated with a steep elevation in PE risk. MR analyses indicated a potential causal effect of eGFR decline on PE (odds ratio&#x2009;=&#x2009;4&#xb7;26, 95% confidence interval: 2&#xb7;07-8&#xb7;79), with no evidence of horizontal pleiotropy and reverse causality.Our findings support the hypothesis that renal function decline contributes to an elevated PE risk. Together with the high prevalence of chronic kidney diseases globally, there arises the necessity for monitoring and modulation of renal function in effective PE prevention.",
      "authors": [
        "Lyu Y",
        "Li H",
        "Liu X",
        "Zhang X",
        "Chen Y",
        "Fan G",
        "Zhang H",
        "Han Z",
        "Guo Z",
        "Weng H",
        "Hu H",
        "Li X",
        "Zhang Z",
        "Zhang Y",
        "Xu F",
        "Wang C",
        "Wang D",
        "Yang P",
        "Zhai Z"
      ],
      "journal": "Thromb Haemost",
      "publishedDate": "2025 Jul",
      "keywords": [
        "x2009",
        "egfr",
        "patients",
        "were",
        "renal",
        "between",
        "function",
        "using"
      ],
      "researchField": "General Science",
      "subjects": [
        "x2009",
        "egfr",
        "patients",
        "were",
        "renal",
        "between",
        "function",
        "using"
      ],
      "externalId": "39401521",
      "source": "PubMed"
    }
  ]
}