{
  "articles": [
    {
      "title": "Plant bioactive compounds driven microRNAs (miRNAs): A potential source and novel strategy targeting gene and cancer therapeutics.",
      "abstract": "Irrespective of medical technology improvements, cancer ranks among the leading causes of mortality worldwide. Although numerous cures and treatments exist, creating alternative cancer therapies with fewer adverse side effects is vital. Since ancient times, plant bioactive compounds have already been used as a remedy to heal cancer. These plant bioactive compounds and their anticancer activity can also deregulate the microRNAs (miRNAs) in the cancerous cells. Therefore, the deregulation of miRNAs in cancer cells by plant bioactive compounds and the usage of the related miRNA could be a promising approach for cancer cure, mainly to prevent cancer and overcome chemotherapeutic side effect problems. Hence, this review highlights the function of plant bioactive compounds as an anticancer agent through the underlying mechanism that alters the miRNA expression in cancer cells, ultimately leading to apoptosis. Moreover, this review provides insight into using plant bioactive compounds -driven miRNAs as an anticancer agent to develop miRNA-based cancer gene therapy. They can be the potential resource for gene therapy and novel strategies targeting cancer therapeutics.",
      "authors": [
        "Sumaira S",
        "Vijayarathna S",
        "Hemagirri M",
        "Adnan M",
        "Hassan MI",
        "Patel M",
        "Gupta R",
        "Shanmugapriya",
        "Chen Y",
        "Gopinath SCB",
        "Kanwar JR",
        "Sasidharan S"
      ],
      "journal": "Noncoding RNA Res",
      "publishedDate": "2024 Dec",
      "keywords": [
        "cancer",
        "plant",
        "bioactive",
        "compounds",
        "anticancer",
        "mirnas",
        "cells",
        "mirna"
      ],
      "researchField": "Medicine",
      "subjects": [
        "cancer",
        "plant",
        "bioactive",
        "compounds",
        "anticancer",
        "mirnas",
        "cells",
        "mirna"
      ],
      "externalId": "39022680",
      "source": "PubMed"
    },
    {
      "title": "Treatment of kidney diseases in the thermal springs of Pithecusa during the XVIII Century.",
      "abstract": "The island of Pithecusa (Ischia) is a volcanic island in the Tyrrhenian Sea in the north end of the Gulf of Naples at about 30 kilometers from the same city. Pithecusa is very popular for its hot springs which even the ancients used. This report aims to analyze the renal therapeutic benefits of the Pithacusa thermal mineral spring through a review of two different manuscripts: i) \"Di Napoli il seno cratero\"(The gulf of Naples) of Domenico Antonio Parrino (1642-1708) and ii) \"De' rimedi naturali che sono nell'isola di Pithecusa oggi detta Ischia\"(On the natural cures of the island of Pithecusa known today as Ischia)of Giulio Iasolino (1583-1622). These two manuscripts published during the 18th century and both manuscripts highlight the thermal virtues of the thermal springs of Pithecusa. In the past natural remedies were important in the treatment of different diseases including that of thermal springs dating back to ancient Rome. Thermal springs were used to treat spasms, skin diseases, hair loss and various renal ailments. Both manuscripts describe the thermal springs in Ischia and their therapeutic benefits in medical diseases.",
      "authors": [
        "Ricciardi E",
        "Ricciardi CA",
        "Ricciardi B"
      ],
      "journal": "G Ital Nefrol",
      "publishedDate": "2016 Feb",
      "keywords": [
        "thermal",
        "pithecusa",
        "springs",
        "ischia",
        "manuscripts",
        "island",
        "diseases",
        "gulf"
      ],
      "researchField": "Medicine",
      "subjects": [
        "thermal",
        "pithecusa",
        "springs",
        "ischia",
        "manuscripts",
        "island",
        "diseases",
        "gulf"
      ],
      "externalId": "26913894",
      "source": "PubMed"
    },
    {
      "title": "Ginger from ancient times to the new outlook.",
      "abstract": "Ginger is the rhizome of Zingiber officinale, a perennial plant, used alone or in compounds as a spice or remedy in ancient recipes of Iranian traditional medicine (ITM) as an effective tonic for the memory and digestive system, the opener of hepatic obstructions, aphrodisiac, for expelling compact wind from stomach and intestines, diluting, desiccating and emollient of phlegmatic and compact humor sticking to body organs, stomach, intestine, brain and throat. The ITM scholars believed that ginger was a vermifuge as well as a remedy for paralysis and obstructive jaundice. They also revealed that this phytomedicine cures diarrhea due to corrupted food. This study aimed to compare the medicinal properties (afaal) of ginger in ITM with those indicated in modern research.",
      "authors": [
        "Khodaie L",
        "Sadeghpoor O"
      ],
      "journal": "Jundishapur J Nat Pharm Prod",
      "publishedDate": "2015 Feb",
      "keywords": [
        "ginger",
        "remedy",
        "compact",
        "stomach",
        "rhizome",
        "zingiber",
        "officinale",
        "perennial"
      ],
      "researchField": "General Science",
      "subjects": [
        "ginger",
        "remedy",
        "compact",
        "stomach",
        "rhizome",
        "zingiber",
        "officinale",
        "perennial"
      ],
      "externalId": "25866718",
      "source": "PubMed"
    },
    {
      "title": "The new use of an ancient remedy: a double-blinded randomized study on the treatment of rheumatoid arthritis.",
      "abstract": "Rheumatoid arthritis (RA) is the most common chronic inflammatory disease with unknown causes and unknown cures in Western medicine. This double-blinded study aimed to investigate the efficacy and safety of a widely used traditional Chinese medicine (Paeoniflorin (PAE) plus cervus and cucumis polypeptide injection (CCPI) using disease-modifying antirheumatic drugs (DMARD) as a control (methotrexate (MTX) plus leflunomide (LEF)). Patients were randomly assigned to one of the three groups: PAE + CCPI, MTX + LEF, and MTX + LEF + CCPI. The primary end point was the American College of Rheumatology 20% improvement response criteria (ACR20). The secondary end point was that of adverse effect frequencies and the speed of onset action. Our results showed that more patients in the CCPI-containing groups responded to the ACR20 during early treatment. After six months, ACR20 showed no significant difference among the three treatments. The maximum improvement in the two DMARD groups was significantly higher than that in the PAE + CCPI group (p &lt; 0.01). CCPI made the onset action of the DMARD therapy 4.6 times faster. PAE + CCPI had significantly lower adverse event incidences than the two DMARD groups. These results indicate that PAE + CCPI appear to be a more acceptable alternative to DMARDs when patients cannot use DMARDs. CCPI appears to be a beneficial add-on to DMARDs that makes the onset of action faster, especially when patients need to relieve RA symptoms as soon as possible. Although not as effective as DMARDs, PAE appears to be a safer option to substitute DMARDs for long-term RA treatment when DMARD toxicity is an issue.",
      "authors": [
        "Chen L",
        "Qi H",
        "Jiang D",
        "Wang R",
        "Chen A",
        "Yan Z",
        "Xiao J"
      ],
      "journal": "Am J Chin Med",
      "publishedDate": "2013",
      "keywords": [
        "ccpi",
        "dmard",
        "dmards",
        "patients",
        "groups",
        "acr20",
        "onset",
        "action"
      ],
      "researchField": "General Science",
      "subjects": [
        "ccpi",
        "dmard",
        "dmards",
        "patients",
        "groups",
        "acr20",
        "onset",
        "action"
      ],
      "externalId": "23548118",
      "source": "PubMed"
    },
    {
      "title": "Hormesis and its relationship with homeopathy.",
      "abstract": "Homeopathy is an ancient and complex therapeutic method that is rediscovering its scientific foundations. Hormesis is a frequently observed phenomenon that has been rigorously reported with precise dose-response curves. The therapeutic method based on the principle of 'like cures like' should not be confused with hormesis, which has several different implications from those of homeopathy. Yet, because both these approaches to nature and medicine are very broad in scope, they do end up having some points of contact. Thus, the well-established and consolidated field of hormesis can help cast light, through its ideas and research methods, on the possible mechanisms of action of remedies in ultra-low doses.",
      "authors": [
        "Bellavite P",
        "Chirumbolo S",
        "Marzotto M"
      ],
      "journal": "Hum Exp Toxicol",
      "publishedDate": "2010 Jul",
      "keywords": [
        "hormesis",
        "homeopathy",
        "therapeutic",
        "like",
        "ancient",
        "complex",
        "rediscovering",
        "scientific"
      ],
      "researchField": "General Science",
      "subjects": [
        "hormesis",
        "homeopathy",
        "therapeutic",
        "like",
        "ancient",
        "complex",
        "rediscovering",
        "scientific"
      ],
      "externalId": "20558609",
      "source": "PubMed"
    },
    {
      "title": "Absence of contact sensitization to Aloe vera (L.) Burm. f.",
      "abstract": "Aloe vera has been used as a cosmetic and medical remedy since ancient times and has gained increasing popularity in recent years. Despite its widespread use, reports of allergic reactions are rare. We patch tested 702 consecutive patients with an oily extract from the leaves, Aloe pulvis from the entire plant and concentrated Aloe vera gel. A specially designed questionnaire was used for the use of Aloe vera, reasons and location of application, adverse reactions, occupation, hobbies and atopy. None of the subjects showed any reaction to one of the preparations. 2 components of the plant have to be distinguished: the bark of the leaves contains anthrachinones with pro-peristaltic and potential antibiotic and anticancer properties. Constraints have been imposed due to their considerable toxic potential. Today, mostly the Aloe gel from the center of the leaves is processed. It almost exclusively consists of carbohydrates to which also many medical effects have been attributed. Carbohydrates are not likely to induce contact sensitization, which might explain the outcome of our study. However, this does not justify unrestrained promotion of Aloe products, as scientific studies investigating the claims on its constitutional effects are few in number, and the majority of them have been unable to diminish the intuitive scepticism against miracle cures, like Aloe seems to be.",
      "authors": [
        "Reider N",
        "Issa A",
        "Hawranek T",
        "Schuster C",
        "Aberer W",
        "Kofler H",
        "Fritsch P",
        "Hausen BM"
      ],
      "journal": "Contact Dermatitis",
      "publishedDate": "2005 Dec",
      "keywords": [
        "aloe",
        "been",
        "have",
        "vera",
        "from",
        "leaves",
        "used",
        "medical"
      ],
      "researchField": "Medicine",
      "subjects": [
        "aloe",
        "been",
        "have",
        "vera",
        "from",
        "leaves",
        "used",
        "medical"
      ],
      "externalId": "16364121",
      "source": "PubMed"
    },
    {
      "title": "Dental treatment in Anglo-Saxon England.",
      "abstract": "Anglo-Saxon medical literature suggests that care of the teeth was largely limited to non-invasive treatment. Cures, mainly for toothache, were based on herbal remedies, charms and amulets. Herbal potions also treated oral problems as diverse as caries and facial deformities. However, surgical intervention for cleft lip is mentioned in the later documents. Skeletal evidence confirms that cleft lip and palate was definitely known to the Anglo-Saxons. A possible dentist's grave has been identified.",
      "authors": [
        "Anderson T"
      ],
      "journal": "Br Dent J",
      "publishedDate": "2004 Sep 11",
      "keywords": [
        "anglo",
        "herbal",
        "cleft",
        "saxon",
        "medical",
        "literature",
        "suggests",
        "care"
      ],
      "researchField": "Medicine",
      "subjects": [
        "anglo",
        "herbal",
        "cleft",
        "saxon",
        "medical",
        "literature",
        "suggests",
        "care"
      ],
      "externalId": "15359327",
      "source": "PubMed"
    },
    {
      "title": "Effect of ethanolic extract of Embelia ribes on dyslipidemia in diabetic rats.",
      "abstract": "Diabetes mellitus has been treated orally with herbal remedies based on folk medicine since ancient times. Embelia ribes burm (Myrsinaceae), known commonly as vidanga, was used in Ayurveda for its anthelmintic activity. Ayurveda describes vidanga as pungent, causes increase in digestive fire, and cures flatulence and colic. A single study reported the antihyperglycemic activity of decoction of E. ribes in glucose-induced hyperglycemic albino rabbits. In the present study, the lipid-lowering and antioxidant potential of ethanolic extract of E. ribes burm was investigated in streptozotocin (40 mg/kg, IV, single injection)-induced diabetes in rats. Twenty days of orally feeding the extract (200 mg/kg) to diabetic rats resulted in significant (P &lt; 0.01) decrease in blood glucose, serum total cholesterol, and triglycerides, and increase in HDL-cholesterol levels when compared to pathogenic diabetic rats. Further, the extract also lowered the liver and pancreas thiobarbituric acid-reactive substances (TBARSs) values (P &lt; 0.01) when compared to TBARS values of liver and pancreas of pathogenic diabetic rats. The results of test drug were comparable to gliclazide (25 mg/kg, orally), a standard antihyperglycemic agent. This is the first pilot study to provide biochemical evidence of potential of E. ribes in diabetic dyslipidemia.",
      "authors": [
        "Bhandari U",
        "Kanojia R",
        "Pillai KK"
      ],
      "journal": "Int J Exp Diabetes Res",
      "publishedDate": "2002 Jul-Sep",
      "keywords": [
        "ribes",
        "rats",
        "diabetic",
        "orally",
        "extract",
        "diabetes",
        "burm",
        "vidanga"
      ],
      "researchField": "General Science",
      "subjects": [
        "ribes",
        "rats",
        "diabetic",
        "orally",
        "extract",
        "diabetes",
        "burm",
        "vidanga"
      ],
      "externalId": "12458656",
      "source": "PubMed"
    },
    {
      "title": "[Lessons from the history of therapy--therapeutic optimism and its pitfalls].",
      "abstract": "If we are to help patients effectively, our understanding of diseases and our therapeutic potential should, again and again, just be somewhat better than they actually are. Throughout the ages this has been the fundamental situation in medical practice. The response on the physician's part has nearly always been an attitude of therapeutic optimism. At all times physicians--and patients also--have relied on therapeutic principles and remedies based on professional experience and medical theory. In conjunction with the (generally recognized) healing powers of nature, and of (unrecognized) autosuggestion, this has led to many satisfactory and even remarkable cures. Examples from antiquity to the 19th century are quoted, and the snags of an over-optimistic attitude become evident, viz. a rational therapy is no better than the underlying pathogenetic theory; exaggerated therapeutic activity may cause useless torment to the patient (a point already made by Hippocrates); the optimistic physician or the enthusiastic pioneer of a new remedy may be blind to toxic side effects or the development of addiction. To sum up: therapeutic optimism is fine--but don't overdo it!",
      "authors": [
        "Koelbing HM"
      ],
      "journal": "Schweiz Med Wochenschr",
      "publishedDate": "1983 Oct 1",
      "keywords": [
        "therapeutic",
        "patients",
        "again",
        "better",
        "than",
        "been",
        "medical",
        "physician"
      ],
      "researchField": "Computer Science",
      "subjects": [
        "therapeutic",
        "patients",
        "again",
        "better",
        "than",
        "been",
        "medical",
        "physician"
      ],
      "externalId": "6356344",
      "source": "PubMed"
    }
  ]
}